app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors"   ORDER BY "instructors"."last_name" ASC
---
  def index
    @instructors = Instructor.order(:last_name)