app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.order(:name)
---
SELECT "subjects".* FROM "subjects"   ORDER BY "subjects"."name" ASC