app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users"   ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2016-03-13 17:50:13.509174"], ["name", "Drew"], ["password_digest", "drew"], ["updated_at", "2016-03-13 17:50:13.509174"]]